app/controllers/saved_weathers_controller.rb

  def index
    # binding.pry
    if params[:thing].present?
      @location = params[:thing][:search_city]
      yahoo_response = Weather.lookup_by_location("#{@location}, UA",
                                                  Weather::Units::CELSIUS)
      owm_response = JSON.load(open("http://api.openweathermap.org/data/2.5/weather?q=
                                      #{@location},UA&units=metric&APPID=92fef38bd079859aea812af22a95f4de"))
      SavedWeather.create!(yahoo_title: yahoo_response.title,
                           yahoo_temp: yahoo_response.condition.temp,
                           yahoo_text: yahoo_response.condition.text,
                           owm_min: owm_response['main']['temp_min'],
                           owm_max: owm_response['main']['temp_max'],
                           owm_cloud: owm_response['weather'][0]['description'])
    end
    @saved_weathers = SavedWeather.all
---
INSERT INTO "saved_weathers" ("yahoo_title", "yahoo_temp", "yahoo_text", "owm_min", "owm_max", "owm_cloud", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT "saved_weathers".* FROM "saved_weathers"

  def create
    @saved_weather = SavedWeather.new(saved_weather_params)
    respond_to do |format|
      if @saved_weather.save
---
INSERT INTO "saved_weathers" ("search_city", "created_at", "updated_at") VALUES (?, ?, ?)  [["search_city", "kiev"], ["created_at", "2017-11-21 13:05:52.368762"], ["updated_at", "2017-11-21 13:05:52.368762"]]

  def update
    respond_to do |format|
      if @saved_weather.update(saved_weather_params)
---
UPDATE "saved_weathers" SET "search_city" = ?, "updated_at" = ? WHERE "saved_weathers"."id" = ?  [["search_city", "search"], ["updated_at", "2017-11-21 13:02:34.809454"], ["id", 2]]

  def destroy
    @saved_weather.destroy
---
DELETE FROM "saved_weathers" WHERE "saved_weathers"."id" = ?  [["id", 1]]

  def set_saved_weather
    @saved_weather = SavedWeather.find(params[:id])
---
SELECT  "saved_weathers".* FROM "saved_weathers" WHERE "saved_weathers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]